       IDENTIFICATION DIVISION.
       PROGRAM-ID. AddTen.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INPUT-NUMBER PIC 9(5).
       01 RESULT-NUMBER PIC 9(5).

       PROCEDURE DIVISION.
           DISPLAY "Digite um numero: ".
           ACCEPT INPUT-NUMBER.
           ADD 10 TO INPUT-NUMBER GIVING RESULT-NUMBER.
           DISPLAY "O resultado e: " RESULT-NUMBER.
           STOP RUN.

